#유형:
# 'x':x축의 위치
# 'y':y축의 위치
# 'color': 말의 색깔
# 'role': 말의 역학
# 'order':바둑돌이 놓인 순서


# 유형:'체스말'은 다음 키를 갖는 사전이다.
# 'x':x축의 위치
# 'y':y축의 위치
# 'color': 말의 색깔
# 'role': 말의 역할
# 체스말={x축의 위치, y축의 위치, 색깔, 역할}

체스말1 = {'x': 'A', 'y': '8', 'color': 'black', 'role': '룩'}
체스말2 = {'x': 'E', 'y': '1', 'color': 'white', 'role': '킹'}

# 이곳에 바둑돌 데이터 유형 정의하기
# 'x':x축의 위치
# 'y':y축의 위치
# 'color': 말의 색깔
# 'order':바둑돌이 놓인 순서

# 체스말={x축의 위치, y축의 위치, 순서, 색깔깔
바둑돌1 = {'x': 8, 'y': 14, 'order': 83, 'color': '흑'}
바둑돌2 = {'x': 12, 'y': 3, 'order': 84, 'color': '백'}